
//Dobrynin Oleksii KI-43, Laboratory work №3

/*
*	Створити діаграму класів «Шеф-Кухар» та консольну програму, що задовольняє
* наступним вимогам:
*	1. Використовувати можливості ООП: класи, наслідування, поліморфізм,
* інкапсуляція.
*	2. Кожен клас повинен мати вичерпний сенс, назву та інформативний
* склад.
*	3. Наслідування слід застосовувати лише тоді, коли це має сенс.
*	4. Класи мають бути грамотно розкладені за пакетами.
*	5. При необхідності для виконання завдання можна створювати
* додаткові класи.
*	6. Робота з консоллю має бути мінімальною (лише для демонстрації
* робочого коду).
*	7. В ієрархії класів повинні бути присутні абстрактний клас та нащадок
* другого рівня.
*	8. Сортування забезпечити використанням інтерфейсу Comparable.
*
* Шеф-кухар. Визначити ієрархію овочів. Зробити салат. Порахувати
* калорійність. Провести сортування овочів для салату на основі одного із
* параметрів. Знайти овочі в салаті, які відповідають заданому діапазону
* калорійності.	
*/

public class Onion extends RootVegetable {
	private String variety;

    public Onion(String variety, int calories) {
        super(calories, false);
        this.variety = variety;
    }
    
    // getter and setter
    public void setVariety(String variety) {
    	this.variety = variety;
    }
    
    public String getVariety() {
    	return this.variety;
    }
}
